app/controllers/carts_controller.rb

SELECT `carts`.* FROM `carts`
---
  def index
    @carts = Cart.all

INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2020-12-28 06:13:08.441769', '2020-12-28 06:13:08.441769')
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save

DELETE FROM `carts` WHERE `carts`.`id` = 980190964
---
  def destroy
    @cart.destroy if @cart.id == session[:cart_id]

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190963 LIMIT 1
---
    def set_cart
      @cart = Cart.find(params[:id])