app/controllers/carts_controller.rb

INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2020-12-24 12:43:32.081719', '2020-12-24 12:43:32.081719')
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save

DELETE FROM `carts` WHERE `carts`.`id` = 6
---
  def destroy
    @cart.destroy if @cart.id == session[:cart_id]

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 6 LIMIT 1
---
    def set_cart
      @cart = Cart.find(params[:id])