app/controllers/line_items_controller.rb

SELECT `line_items`.* FROM `line_items`
---
  def index
    @line_items = LineItem.all

SELECT `products`.* FROM `products` WHERE `products`.`id` = 207281424 LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2020-12-28 06:13:07.692774', '2020-12-28 06:13:07.692774')
INSERT INTO `line_items` (`product_id`, `cart_id`, `created_at`, `updated_at`) VALUES (207281424, 980190963, '2020-12-28 06:13:07.713655', '2020-12-28 06:13:07.713655')
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save

DELETE FROM `line_items` WHERE `line_items`.`id` = 980190962
---
  def destroy
    @line_item.destroy

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
---
    def set_line_item
      @line_item = LineItem.find(params[:id])