app/controllers/line_items_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
INSERT INTO `line_items` (`product_id`, `cart_id`, `created_at`, `updated_at`) VALUES (1, 1, '2020-12-30 09:43:39.697830', '2020-12-30 09:43:39.697830')
UPDATE `line_items` SET `line_items`.`quantity` = 2, `line_items`.`updated_at` = '2020-12-30 11:06:37.568614' WHERE `line_items`.`id` = 6
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 1 LIMIT 1
---
    def set_line_item
      @line_item = LineItem.find(params[:id])