app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT `orders`.* FROM `orders`

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO `orders` (`name`, `address`, `email`, `pay_type`, `created_at`, `updated_at`) VALUES ('ss', 's', 'aa@gmail.com', 1, '2021-01-04 12:46:27.205021', '2021-01-04 12:46:27.205021')
DELETE FROM `carts` WHERE `carts`.`id` = 11

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE `orders` SET `orders`.`address` = 'fddd', `orders`.`updated_at` = '2020-12-31 04:49:51.094476' WHERE `orders`.`id` = 2

    def set_order
      @order = Order.find(params[:id])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1

     def ensure_cart_isnt_empty
       if @cart.line_items.empty?
---
SELECT 1 AS one FROM `line_items` WHERE `line_items`.`cart_id` = 11 LIMIT 1