app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`title`, `description`, `image_url`, `price`, `created_at`, `updated_at`) VALUES ('Seven Mobile Apps', 'Perhaps it isn’t the prettiest interface, but it works, and we can show it to\r\nour client for approval. She can play with the other links (showing details,\r\nediting existing products, and so on). We explain to her that this is only a\r\nfirst step—we know it’s rough, but we wanted to get her feedback early. (And\r\nfour commands probably count as early in anyone’s book.)', '/images/apps.jpg', 26, '2020-12-23 08:27:22.382180', '2020-12-23 08:27:22.382180')

  def update
    respond_to do |format|
      if @product.update(product_params)
        format.html { redirect_to @product,
          notice: 'Product was successfully updated.' }
        format.json { render :show, status: :ok, location: @product }

        @products = Product.all
---
UPDATE `products` SET `products`.`price` = 45, `products`.`updated_at` = '2020-12-28 12:21:40.063727' WHERE `products`.`id` = 3
SELECT `products`.* FROM `products`

    def set_product
      @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1