app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`title`, `description`, `image_url`, `price`, `created_at`, `updated_at`) VALUES ('Lorem Ipsum', 'Wibbles are fun!', 'lorem.jpg', 19, '2020-12-28 07:11:02.961076', '2020-12-28 07:11:02.961076')

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `products`.`title` = 'Lorem Ipsum', `products`.`description` = 'Wibbles are fun!', `products`.`image_url` = 'lorem.jpg', `products`.`price` = 19, `products`.`updated_at` = '2020-12-28 07:13:16.143757' WHERE `products`.`id` = 980190962

  def destroy
    @product.destroy
---
DELETE FROM `products` WHERE `products`.`id` = 980190962

    def set_product
      @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 LIMIT 1