app/models/order.rb

  def add_line_items_from_cart(cart)
    cart.line_items.each do |item|
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 1