app/views/layouts/application.html.erb

        <% if @cart %>
          <%= hidden_div_if(@cart.line_items.empty?, id: 'cart') do %>
---
SELECT 1 AS one FROM `line_items` WHERE `line_items`.`cart_id` = 8 LIMIT 1